In [2]:
%matplotlib inline
import pandas as pd

In [ ]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [9]:
titles = pd.read_csv("C:\\Users\\Dell\\Desktop\\titles.csv")
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [5]:
titles.shape

(244914, 2)

In [ ]:
#  244914 movies are listed in the dataframe

### What are the earliest two films listed in the titles dataframe?

In [25]:
titles.sort_values(by=['year'],ascending= False)

                                                 title  year
242196                                       100 Years  2115
183018                        The Zero Century: Maetel  2026
34213                                         Avatar 5  2025
224450                                    War in Black  2024
204823                                   The Dark Room  2024
...                                                ...   ...
108586                            Family Troubles (II)  1900
78564                         Trouble in Hogan's Alley  1900
4584    Reproduction of the Corbett and Jeffries Fight  1899
51388                               The Startled Lover  1898
193222                                      Miss Jerry  1894

[244914 rows x 2 columns]

In [ ]:
# 100 Years, The zero Century:Maetel are the earliest two films listed in the titles dataframe

### How many movies have the title "Hamlet"?

In [29]:
titles[titles['title']=="Hamlet"].count()

title    20
year     20
dtype: int64

In [ ]:
20 movies have the title "Hamlet"

### How many movies are titled "North by Northwest"?

In [30]:
titles[titles['title']=="North by Northwest"].count()

title    1
year     1
dtype: int64

1 movies have titled "North by Northwest"

### When was the first movie titled "Hamlet" made?

In [32]:
titles[titles['title']=="Hamlet"].sort_values(by=['year'],ascending= True)

         title  year
52521   Hamlet  1910
198234  Hamlet  1911
39916   Hamlet  1913
10637   Hamlet  1921
101728  Hamlet  1948
172640  Hamlet  1954
161324  Hamlet  1964
67406   Hamlet  1969
122827  Hamlet  1973
133921  Hamlet  1976
82130   Hamlet  1987
192142  Hamlet  1990
178222  Hamlet  1996
62000   Hamlet  2000
189093  Hamlet  2009
173033  Hamlet  2011
202025  Hamlet  2014
154029  Hamlet  2015
88065   Hamlet  2016
6422    Hamlet  2017

In [ ]:
# 1910 was the year when the first movie titled "Hamlet" made

### List all of the "Treasure Island" movies from earliest to most recent.

In [33]:
titles[titles['title']== "Treasure Island"].sort_values(by=['year'],ascending= True)

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [36]:
titles[titles['year']==1950].count()

title    1113
year     1113
dtype: int64

In [ ]:
# 1113 movies were made in the year 1950

### How many movies were made in the year 1960?

In [37]:
titles[titles['year']==1960].count()

title    1549
year     1549
dtype: int64

In [ ]:
# 1549 movies were made in the year 1960

### How many movies were made from 1950 through 1959?

In [43]:
titles[(titles['year']>=1950) & (titles['year']<=1959)].count()

title    12934
year     12934
dtype: int64

In [ ]:
# 12934 movies were made from 1950 through 1959

### In what years has a movie titled "Batman" been released?

In [50]:
df1[df1['title']=="Batman"]

        title  year         country        date
39316  Batman  1943             USA  1943-07-16
39317  Batman  1943          Mexico  1946-11-01
39318  Batman  1943        Portugal  1950-05-29
39319  Batman  1943    West Germany  1966-06-19
39320  Batman  1989             USA  1989-06-23
39321  Batman  1989         Ireland  1989-08-11
39322  Batman  1989              UK  1989-08-11
39323  Batman  1989       Australia  1989-08-31
39324  Batman  1989         Belgium  1989-09-13
39325  Batman  1989          France  1989-09-13
39326  Batman  1989         Denmark  1989-09-29
39327  Batman  1989     Netherlands  1989-09-29
39328  Batman  1989        Portugal  1989-09-29
39329  Batman  1989           Spain  1989-09-29
39330  Batman  1989          Norway  1989-10-05
39331  Batman  1989          Taiwan  1989-10-07
39332  Batman  1989         Finland  1989-10-20
39333  Batman  1989           Italy  1989-10-20
39334  Batman  1989          Sweden  1989-10-20
39335  Batman  1989          Brazil  1989-10-26
39336  Batman  1989    West Germany  1989-10-26
39337  Batman  1989          Greece  1989-10-27
39338  Batman  1989       Hong Kong  1989-11-02
39339  Batman  1989      Yugoslavia  1989-11-21
39340  Batman  1989        Colombia  1989-11-23
39341  Batman  1989       Argentina  1989-12-14
39342  Batman  1989         Hungary  1989-12-21
39343  Batman  1989           Japan  1989-12-23
39344  Batman  1989         Uruguay  1989-12-25
39345  Batman  1989          Poland  1989-12-31
39346  Batman  1989           India  1990-03-13
39347  Batman  1989     South Korea  1990-07-07
39348  Batman  1989  Czechoslovakia  1992-05-01

In [ ]:
#  "Batman" movie was released in the year 1943 and 1989

### How many roles were there in the movie "Inception"?

In [4]:
df1 = pd.read_csv(r"C:\Users\Dell\Desktop\release_dates.csv")
df1.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [3]:
df2=pd.read_csv("C:\\Users\\Dell\\Desktop\\cast.csv")

In [20]:
df2.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [33]:
df2[df2["title"]=="Inception"].isna().sum()

title         0
year          0
name          0
type          0
character     0
n            27
dtype: int64

In [ ]:
# 27 roles in the movie "Inception" are NOT ranked by an "n" value

### But how many roles in the movie "Inception" did receive an "n" value?

In [34]:
df2[df2["title"]=="Inception"].count()

title        78
year         78
name         78
type         78
character    78
n            51
dtype: int64

In [ ]:
# 51 roles in the movie "Inception" did receive an "n" value

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [35]:
df2[df2["title"]=="North by Northwest"].sort_values(by=['n'],ascending= True)

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
...,...,...,...,...,...,...
3441077,North by Northwest,1959,Maudie Prickett,actress,Elsie - Maid,NaN
3577128,North by Northwest,1959,Doris Singh,actress,First United Nations Receptionist,NaN
3599912,North by Northwest,1959,Helen Spring,actress,Bidder,NaN
3739133,North by Northwest,1959,Susan Whitney,actress,Attendant,NaN
3751311,North by Northwest,1959,Paula Winslowe,actress,Woman at Auction,NaN

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [38]:
df2[(df2["title"]=="Sleuth") & (df2["year"]==1972)].sort_values(by=['n'],ascending= True)

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [39]:
df2[(df2["title"]=="Sleuth") & (df2["year"]==2007)].sort_values(by=['n'],ascending= True)

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [42]:
a=df2[(df2["title"]=="Hamlet") & (df2["year"]==1921)].sort_values(by=['n'],ascending= True)
a["n"].sum()

45.0

In [ ]:
# 45 roles were credited in the silent 1921 version of Hamlet

### How many roles were credited in Branagh’s 1996 Hamlet?

In [28]:
a=df2[(df2["title"]=="Hamlet") & (df2["year"]==1996)].sort_values(by=['n'],ascending= True)
a["n"].sum()

1092.0

In [ ]:
# 1092 roles were credited in Branagh’s 1996 Hamlet

### How many "Hamlet" roles have been listed in all film credits through history?

In [22]:
A=df2[(df2["character"]=="Hamlet")]

In [23]:
A["n"].sum()

490.0

In [ ]:
# 490 "Hamlet" roles have been listed in all film credits through history

### How many people have played an "Ophelia"?

In [21]:
A=df2[(df2["character"]=="Ophelia")]
A["n"].sum()

621.0

In [ ]:
# 621 people have played an "Ophelia"

### How many people have played a role called "The Dude"?

In [29]:
A=df2[(df2["character"]=="The Dude")]
A["n"].sum()

173.0

In [ ]:
# 173 people have played a role called "The Dude"

### How many people have played a role called "The Stranger"?

In [30]:
A=df2[(df2["character"]=="The Stranger")]
A["n"].sum()

880.0

In [ ]:
# 880 people have played a role called "The Stranger"

### How many roles has Sidney Poitier played throughout his career?

In [34]:
A=df2[(df2["name"]=="Sidney Poitier")]
A["n"].sum()

116.0

In [ ]:
# 116 roles has Sidney Poitier played throughout his career

### How many roles has Judi Dench played?

In [35]:
A=df2[(df2["name"]=="Judi Dench")]
A["n"].sum()

450.0

In [ ]:
# 450 roles has Judi Dench played

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [41]:
A=df2[(df2["name"]=="Cary Grant") & (df2["year"]==1940)]
(A["n"]==2).sum()

1

In [ ]:
# 1 supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [42]:
A=df2[(df2["name"]=="Cary Grant") & (df2["year"]==1940)].sort_values(by=['year'],ascending= True)

In [43]:
A

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [49]:
A=df2[(df2["type"]=="actor") & (df2["year"]==1950)]

In [50]:
A["type"].count()

16760

In [ ]:
# 16760 roles were available for actors in the 1950s

### How many roles were available for actresses in the 1950s?

In [51]:
A=df2[(df2["type"]=="actress") & (df2["year"]==1950)]

In [52]:
(A["n"].count())

3204

In [ ]:
# 3204 roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [53]:
A=df2[(df2["n"]==1) & (df2["year"]>=1980)]

In [55]:
A.count()

title        89276
year         89276
name         89276
type         89276
character    89276
n            89276
dtype: int64

In [ ]:
# 89276 leading roles (n=1) were available from the beginning of film history through 1980

### How many non-leading roles were available through from the beginning of film history through 1980?

In [70]:
A=df2[(df2["year"]>=1980)]

In [73]:
A.isna().sum()

title              0
year               0
name               0
type               0
character          0
n            1014692
dtype: int64

In [ ]:
# 1014692 non-leading roles were available through from the beginning of film history through 1980

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [76]:
A=df2[(df2["year"]>=1980)]
A.isna().sum()

title              0
year               0
name               0
type               0
character          0
n            1014692
dtype: int64

In [ ]:
# 1014692 roles through 1980 were minor enough that they did not warrant a numeric "n" rank